<template>
    <div>
        <PreviewSection
            title="О нас"
            img="/publicImg/previewSections/about.jpg.webp" />
        <section>
            <div class="container">
                <h2>О нас</h2>
                <p>
                    Свою историю компания <span class="bold">Максимум УЮТ</span
                    > начала в 2012 году. Вдохновившись поездкой на мебельную
                    выставку, организатор проекта, Павел Валуев, всерьез решил
                    заняться изучением мебели и налаживанием всего
                    производственного процесса.
                </p>
                <p>
                    С 2012 по 2018 г. компания работала по рекомендациям и
                    сарафанному радио.
                </p>
                <p>
                    С 2019 года – <span class="bold">Максимум УЮТ</span> имеет
                    свое собственное производство и интернет-магазин.
                </p>
                <p>
                    Мы постоянно растем и развиваемся. Так в 2022 году было
                    принято решение, открыть офис, который открывает больше
                    возможностей для клиентов: можно приехать и увидеть все
                    предлагаемые образцы, также, прям в офисе, просчитать
                    стоимость изделия по размерам и желанию клиента, что не
                    исключает дальнейшего замера помещения по адресу клиента.
                </p>
                <p>
                    <span class="bold">Максимум Уют</span> работает со многими
                    мебельными фабриками и производствами в Москве и
                    МО. Компания производит корпусную мебель самой различной
                    сложности, используя материалы и фурнитуру от эконома до
                    премиум - класса.
                </p>
            </div>
        </section>
        <section>
            <div class="container">
                <div class="contacts">
                    <div>
                        <h2>Контакты</h2>
                        <p>
                            <span class="bold">Адрес: </span>
                            <a :href="this.$store.state.address_maps_url">{{
                                this.$store.state.address
                            }}</a>
                        </p>
                        <p>
                            <span class="bold">Телефон: </span>
                            <a :href="'tel:' + this.$store.state.tel">{{
                                this.$store.state.tel
                            }}</a>
                        </p>
                        <p>
                            <span class="bold">Почта: </span>
                            <a :href="'mailto:' + this.$store.state.email">{{
                                this.$store.state.email
                            }}</a>
                        </p>
                    </div>
                    <iframe
                        src="https://yandex.ru/map-widget/v1/?um=constructor%3Afc2db1a8bade98367cd26529591b34c8a5502f0c96f7027f400c582e4c7d886b&amp;source=constructor"></iframe>
                </div>
            </div>
        </section>
        <section>
            <div class="container">
                <h2>Сотрудничество</h2>
                <p>
                    Приглашаем к сотрудничеству дизайнеров, строителей и
                    ремонтные бригады.
                </p>
                <p>
                    Мы максимально ответственно подходим к работе и оперативно
                    консультируем наших партнеров по техническим вопросам, что
                    позволяет вам заранее учесть все нюансы и оптимизировать
                    процесс работы. Благодаря этому сотрудничеству, вы сможете
                    сэкономить время и средства, не допуская ошибок в процессе
                    реализации проекта.
                </p>
                <p>
                    Мы всегда готовы подготовить для вас коммерческое
                    предложение и дать подробную информацию о сроках и условиях
                    сотрудничества. Наши специалисты обладают большим опытом.
                </p>
                <p>
                    Мы стараемся быть доступными для наших партнеров и держим
                    связь с ними любым удобным для них способом. Вы можете
                    связаться с нами по телефону, электронной почте, WhatsApp
                    или Telegram, и мы всегда будем рады помочь вам.
                </p>
                <p>
                    Сотрудничество с нами предполагает достойное вознаграждение
                    за ваш труд. Мы ценим наших партнеров и готовы предложить им
                    выгодные условия сотрудничества.
                </p>
                <div class="centered">
                    <router-link :to="{ hash: '#form' }" class="btn">
                        Узнать больше
                    </router-link>
                </div>
            </div>
        </section>
        <section id="measuring">
            <div class="container">
                <h2>Замер</h2>
                <p>
                    Замер платный. Стоимость выезда замерщика на одно изделие 2 500р, далее последующие изделие 500р за изделие, при оформлении договора, стоимость замера входит в стоимость изделия. Т.е., становится бесплатным.
                </p>
                <p>
                    В компетенцию замерщика входит не только замер помещения, но
                    и правильность выбора конструкции, технические советы и
                    заключения договора на стороне заказчика.
                </p>
                <p>
                    Вашему вниманию будет предоставлен наш фото каталог для
                    наглядного представления готовых изделий.
                </p>
                <div class="block">
                    <h3>Преимущества вызова замерщика:</h3>
                    <p>
                        Наши замерщики выполняют точные замеры до миллиметра; Вы
                        сможете задать все интересующие Вас вопросы
                        профессионалу; Мы учтем все Ваши пожелания; Мы подберем
                        оптимальный вариант по цене; Мы несем ответственность за
                        точность проведенного замера!
                    </p>
                </div>
            </div>
        </section>
        <section id="delivery">
            <div class="container">
                <h2>Доставка</h2>
                <div class="block">
                    <h3>Условия доставки</h3>
                    <p>
                        Стоимость доставки – 2 500 руб. до подъезда в пределах МКАД (за МКАД 50 руб./км.)
                    </p>
                    <p>
                        Подъем на этаж по прайсу (в зависимости от наличия лифта, удаленность до подъезда, объем и т.д.)
                    </p>
                </div>
                <div class="block">
                    <h3>Обращаем ваше внимание</h3>
                    <p>
                        Доставку товара мы осуществляем в интервале времени, а
                        не к определенному часу. Перед осуществлением доставки с
                        вами свяжется экспедитор и предупредит о времени визита.
                        В случае отсутствия получателя на адресе доставки
                        экспедитор будет ожидать 15 минут.
                    </p>
                    <p>
                        В случае невозможности подъезда а/м к месту разгрузки
                        (до подъезда многоквартирного дома или до калитки/забора
                        частного домовладения) оплачивается пронос мебели
                        вручную.
                    </p>
                    <p>
                        При наличии пропускного режима в месте оказания услуги
                        необходимо обеспечить оформление пропуска на территорию
                        для проезда автотранспорта специалиста.
                    </p>
                    <p>
                        В случае наличия только платной парковки в месте
                        оказания услуги необходимо обеспечить оплату
                        парковочного места для автотранспорта специалиста.
                    </p>
                    <p>
                        Уборка упаковочного материала. Упаковочный материал складывается в помещении, где производится работа.
                    </p>
                </div>
            </div>
        </section>
        <section id="montage">
            <div class="container">
                <h2>Монтаж</h2>
                <p>
                    Стоимость установки : 10% от стоимости изделия по договору.
                </p>
                <p>
                    Стоимость монтажа встроенной мебели: 15% от стоимости
                    мебели.
                </p>
            </div>
        </section>
        <CallMeForm />
    </div>
</template>

<script>
import PreviewSection from "@/components/PreviewSection.vue";
import CallMeForm from "@/components/CallMeForm.vue";

export default {
    name: "About",
    components: { PreviewSection, CallMeForm },
};
</script>

<style scoped>
section p {
    font-size: 24px;
    line-height: 140%;
    margin-bottom: 20px;
}

.block {
    margin: 30px 0;
}
h3 {
    font-size: 24px;
    text-transform: uppercase;
    margin-bottom: 10px;
}

.contacts {
    display: flex;
    align-items: flex-start;
    justify-content: space-between;
    gap: 30px;
}
.contacts p {
    font-size: 26px;
    margin-bottom: 30px;
}
.contacts iframe {
    min-width: 60%;
    height: 400px;
    border: none;
    border-radius: 10px;
}

@media screen and (max-width: 1250px) {
    .contacts {
        flex-direction: column;
    }
    .contacts iframe {
        width: 100%;
    }
    section p {
        font-size: 20px;
    }
}

@media screen and (max-width: 850px) {
    h3 {
        font-size: 20px;
    }
    section p {
        font-size: 16px;
        margin-bottom: 10px;
    }
}

@media screen and (max-width: 480px) {
}
</style>
