<template>
    <div>
        <section style="margin-bottom: 50px">
            <div class="container">
                <div class="row">
                    <div class="text-center">
                        <div class="main-about-onas">
                            <div
                                style="
                                    font-size: 18px;
                                    line-height: 140%;
                                    margin-bottom: 30px;
                                ">
                                <h2>О нас</h2>
                                <p>
                                    Свою историю компания “Максимум УЮТ” начала в
                                    2012 году. Вдохновившись поездкой на мебельную
                                    выставку, организатор проекта, Павел Валуев,
                                    всерьез решил заняться изучением мебели и
                                    налаживанием всего производственного процесса.
                                </p>
                                <p>
                                    С 2012 по 2018 г. компания работала по
                                    рекомендациям и сарафанному радио.
                                </p>
                                <p>
                                    С 2019 года – Максимум УЮТ имеет свое
                                    собственное производство и
                                    интернет-магазин.&nbsp;
                                </p>
                                <p>
                                    Мы постоянно растем и развиваемся. Так в 2022
                                    году было принято решение, открыть офис, который
                                    открывает больше возможностей для клиентов:
                                    можно приехать и увидеть все предлагаемые
                                    образцы, также, прям в офисе, просчитать
                                    стоимость изделия по размерам и желанию клиента,
                                    что не исключает дальнейшего замера помещения по
                                    адресу клиента.&nbsp;
                                </p>
                                <p>
                                    Максимум Уют работает со многими мебельными
                                    фабриками и производствами в Москве и
                                    МО. Компания производит корпусную мебель самой
                                    различной сложности, используя материалы и
                                    фурнитуру от эконома до премиум - класса.&nbsp;
                                </p>
                                <p>
                                    Мебель — это, безусловно, важная часть в жизни
                                    каждого человека. От мебели зависит степень уюта
                                    и возможность комфортного проживания в своём
                                    доме.&nbsp;
                                </p>
                            </div>
                            <div class="col-md-6 col-lg-7 col-xs-12">
                                <div class="preview-image">
                                    <!-- <img
                                        src="@/assets/img/previewSections/preview-mebel-na-zakaz.jpg"
                                        alt=""
                                        class="img-responsive center-block" /> -->
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    </div>
</template>
